[
  "notion-like-tables",
  "multi-column-markdown",
  "obsidian-columns",
  "chatgpt-md",
  "page-gallery",
  "obsidian-style-settings",
  "obsidian-linter",
  "make-md",
  "obsidian-icon-folder",
  "obsidian-git"
]