[
  "flashcards-obsidian",
  "obsidian-pocket",
  "nldates-obsidian",
  "cycle-through-panes",
  "obsidian-auto-link-title",
  "tag-wrangler",
  "simple-embeds",
  "oz-image-plugin",
  "quick-latex",
  "wikilinks-to-mdlinks-obsidian",
  "obsidian-local-images"
]